cask_args appdir: '~/Applications'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'adoptopenjdk/openjdk'

cask 'java' unless system "/usr/libexec/java_home --failfast" # Must be added early on
cask 'adoptopenjdk11'

brew 'mas'

cask '1password'
mas '1Password for Safari', id: 1569813296
mas 'Tailscale', id: 1475387142

cask 'font-jetbrains-mono'
cask 'font-fira-code'

cask 'iterm2'
cask 'alacritty'
cask 'ngrok'
cask 'visual-studio-code'
cask 'intellij-idea' # 'intellij-idea-ce' for community-edition
cask 'webstorm'

cask 'rectangle'
cask 'kap'
brew 'gifski'

cask 'google-chrome'
cask 'firefox'
cask 'vivaldi'
cask 'postman'
cask 'obsidian'
cask 'remarkable'

cask 'slack'
cask 'discord'
cask 'spotify'
cask 'sonos'

brew 'docker'
brew 'docker-compose'
brew 'colima' # Replaces Docker Desktop

brew 'zsh'
brew 'git'
brew 'gh'
brew 'nodejs'
brew 'nvm'
brew 'maven'
brew 'wget'
brew 'openssl'
brew 'sqlite'
brew 'python3'
brew 'pipenv'
brew 'jq'
brew 'grep'
brew 'fd'
brew 'fzf'
brew 'tree'
brew 'tree-sitter'
brew 'nvim'
brew 'tmux'
brew 'tmuxinator'

cask 'google-cloud-sdk'

# brew 'typescript-language-server' TODO: Add with npm
brew 'tfenv' # Terraform environment
brew 'terraform-ls'
brew 'tflint'
