cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/homebrew-versions'
tap 'homebrew/bundle'
cask 'java' # Must be added early on

brew 'cowsay'
brew 'gdbm'
brew 'xz'
brew 'pcre'
brew 'git'
brew 'git-lfs'
brew 'zsh'
brew 'openssl'
brew 'libevent'
brew 'maven'
brew 'protobuf'
brew 'mobile-shell'
brew 'node'
brew 'readline'
brew 'sqlite'
brew 'postgresql'
brew 'python'
brew 'pypy'
brew 'pypy3'
brew 'python3'
brew 'scala'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'wget'

brew 'caskroom/cask/brew-cask'

cask 'iterm2-beta'
cask 'atom'
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'pycharm'
cask 'clion'
cask 'github-desktop'
cask 'docker'
cask 'virtualbox'

cask 'firefox'
cask 'google-chrome'
cask 'microsoft-office'

cask 'qlcolorcode'
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

cask 'flux'
cask 'spectacle'
cask 'transmission'
cask 'grammarly'
cask 'dropbox'
cask 'google-drive'
cask 'slack'
cask 'dashlane'
#cask 'spotify'
cask 'vlc'
cask 'battle-net'
cask 'the-unarchiver'
